openFoamSims/periodicHill/mlSim/0/Ccz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
288000
(
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
7200
(
0.0375
0.1125
0.1875
0.2625
0.3375
0.4125
0.4875
0.5625
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
7200
(
0.0375
0.1125
0.1875
0.2625
0.3375
0.4125
0.4875
0.5625
...
)
;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
