openFoamSims/periodicHill/mlSim/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
7200
(
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 5.22133e-24 0)
(-4.16087e-07 0 0)
(-4.16087e-07 5.22133e-24 0)
(-4.16087e-07 0 0)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
7200
(
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
(-4.16087e-07 0 0)
...
)
;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
